/*
********************************************************************************
*  Copyright (C), 2009-2012, 合众思壮西安研发中心
*
*  项目名称：E6202
*  
*  文件名称: Public.c
*
*  文件描述：通用模块源文件
*             
*             
*  创 建 者: 皇海明
*
*  创建日期：2013-04-11 
*
*  版 本 号：V1.0
*
*  修改记录： 
*             
*      1. 日    期： 
*         修 改 人： 
*         所作修改： 
*      2. ...
********************************************************************************
*/

#define PUBLIC_GLB
#include "Public.h"





/*
********************************************************************************                                                                  
*  内部函数声明                                                                                                        
********************************************************************************
*/



/*
********************************************************************************                                                                 
*  内部变量定义                                                                                                         
********************************************************************************
*/






/*
********************************************************************************
*  函数名称: FloatToChars
*
*  功能描述: xxxx
*
*  输入参数: 无
*
*  输出参数: 无
*
*  返 回 值: 无
*
********************************************************************************
*/
void FloatToChars(u8 *pdata, float f4)
{
	UNIONFLOAT temp;
	
	temp.f4 = f4;
	pdata[0] = temp.a[3];
	pdata[1] = temp.a[2];
	pdata[2] = temp.a[1];
	pdata[3] = temp.a[0];
}

/*
********************************************************************************
*  函数名称: CharsToFloat
*
*  功能描述: xxxx
*
*  输入参数: 无
*
*  输出参数: 无
*
*  返 回 值: 无
*
********************************************************************************
*/
float CharsToFloat(u8 *pdata)
{
	UNIONFLOAT temp;
	
	temp.f4 = 0;
	temp.a[3] = pdata[0];
	temp.a[2] = pdata[1];
	temp.a[1] = pdata[2];
	temp.a[0] = pdata[3];

	return temp.f4;
}

/*
********************************************************************************
*  函数名称: DoubleToChars
*
*  功能描述: xxxx
*
*  输入参数: 无
*
*  输出参数: 无
*
*  返 回 值: 无
*
********************************************************************************
*/
void DoubleToChars(u8 *pdata, double f8)
{
	UNIONDOUBLE temp;
	
	temp.f8 = f8;
	pdata[0] = temp.a[7];
	pdata[1] = temp.a[6];
	pdata[2] = temp.a[5];
	pdata[3] = temp.a[4];
	pdata[4] = temp.a[3];
	pdata[5] = temp.a[2];
	pdata[6] = temp.a[1];
	pdata[7] = temp.a[0];
}

/*
********************************************************************************
*  函数名称: CharsToDouble
*
*  功能描述: xxxx
*
*  输入参数: 无
*
*  输出参数: 无
*
*  返 回 值: 无
*
********************************************************************************
*/
double CharsToDouble(u8 *pdata)
{
	UNIONDOUBLE temp;
	
	temp.f8 = 0;
	temp.a[7] = pdata[0];
	temp.a[6] = pdata[1];
	temp.a[5] = pdata[2];
	temp.a[4] = pdata[3];
	temp.a[3] = pdata[4];
	temp.a[2] = pdata[5];
	temp.a[1] = pdata[6];
	temp.a[0] = pdata[7];

	return temp.f8;
}


