/*
**********************************************************************************************************
*  Copyright (C), 2009-2012, 合众思壮西安研发中心
*
*  项目名称： E6202
*  
*  文件名称:  GPIO.h
*
*  文件描述： 通用IO口初始化函数
*             
*             
*  创 建 者: 皇海明
*
*  创建日期：2014-05-29 
*
*  版 本 号：V1.0
*
*  修改记录： 
*             
*      1. 日    期： 
*         修 改 人： 
*         所作修改： 
*      2. ...
**********************************************************************************************************
*/
#ifndef __GPIO_H
#define __GPIO_H

#ifdef __cplusplus
extern "C" {
#endif
	
#ifdef  GPIO_GLOBALS
#define GPIO_EXT
#else
#define GPIO_EXT   extern
#endif

#include "stm32f10x.h"
	


/*
*********************************************************************
*  全局宏定义
*********************************************************************
*/
 



/*
*********************************************************************
*  类、结构体类型定义
*********************************************************************
*/

// gpio控制管脚索引，分为输入和输出索引
enum GPIO_INDEX
{
    /* DIGIT INPUT */
    GPIO_INDEX_INSTT = 0,

    /* DIGIT OUTPUT */
    GPIO_INDEX_OUTSTT,
    GPIO_INDEX_PB14,
    GPIO_INDEX_PB15,

    GPIO_INDEX_MAX
};

// gpio输入输出控制结构体
typedef struct _tGPIOCTRLST
{
    u16               Index;
    GPIO_TypeDef     *GPIOx;
	u32               Pin;
	GPIOMode_TypeDef  Mode;
}GPIOCTRLST;


/*
*********************************************************************
*  外部引用变量声明
*********************************************************************
*/

/*
*********************************************************************
*  外部引用函数声明
*********************************************************************
*/
GPIO_EXT        void      GpioInit      (void);
GPIO_EXT        void      GpioOut       (u8 index, u8 value); 
GPIO_EXT        u8        GpioIn        (u8 index);           




#ifdef __cplusplus
}
#endif

#endif /* __GPIO_H */


