/*
********************************************************************************
*  Copyright (C), 2009-2013, 合众思壮西安研发中心
*
*  项目名称：xxxx
*  
*  文件名称: xxxx.c
*
*  文件描述：xxxx
*             
*             
*  创 建 者: 皇海明
*
*  创建日期：2013-03-18 
*
*  版 本 号：V1.0
*
*  修改记录： 
*             
*      1. 日    期： 
*         修 改 人： 
*         所作修改： 
*      2. ...
********************************************************************************
*/
#include "Delay.h"

void DelayUS(uint32_t us)
{
  uint32_t i;
  
  while(us)
  {
    i = 2;
    while(i--);
    us--;
  }
  return;
}

void DelayMS(uint32_t ms)
{
  uint32_t i;
  
  while(ms)
  {
    i = 1800;
    while(i--);
    ms--;
  }
  return;
}







